app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Article 7"], ["body", "Check the flash message"], ["created_at", "2024-07-30 03:23:54.910079"], ["updated_at", "2024-07-30 03:23:54.910079"], ["status", "public"]]

  def destroy
    @article = Article.find(params[:id])
    article_title = @article.title
    @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 10]]